; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	infrared0 - mode
	spectrograph3 - mode
	image1 - mode
	thermograph2 - mode
	thermograph4 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	Star0 - direction
	Phenomenon3 - direction
	Star4 - direction
	Planet5 - direction
	Star6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
	Star12 - direction
	Planet13 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Star16 - direction
	Planet17 - direction
	Star18 - direction
	Planet19 - direction
	Star20 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 thermograph2)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 image1)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star16)
	(supports instrument3 infrared0)
	(supports instrument3 thermograph4)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 infrared0)
	(supports instrument4 thermograph4)
	(calibration_target instrument4 Star0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon8)
	(supports instrument5 image1)
	(supports instrument5 spectrograph3)
	(supports instrument5 thermograph4)
	(calibration_target instrument5 GroundStation1)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star0)
	(supports instrument6 thermograph2)
	(supports instrument6 thermograph4)
	(supports instrument6 image1)
	(calibration_target instrument6 GroundStation2)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet13)
	(supports instrument7 thermograph4)
	(calibration_target instrument7 Star0)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation1)
)
(:goal (and
	(pointing satellite1 Star9)
	(pointing satellite2 Phenomenon3)
	(pointing satellite4 Star4)
	(have_image Phenomenon3 infrared0)
	(have_image Star4 spectrograph3)
	(have_image Planet5 spectrograph3)
	(have_image Star6 thermograph2)
	(have_image Phenomenon8 thermograph4)
	(have_image Star9 thermograph2)
	(have_image Planet10 image1)
	(have_image Star11 infrared0)
	(have_image Planet13 spectrograph3)
	(have_image Planet14 thermograph4)
	(have_image Phenomenon15 spectrograph3)
	(have_image Star16 thermograph2)
	(have_image Planet17 image1)
	(have_image Star18 thermograph2)
	(have_image Planet19 thermograph4)
	(have_image Star20 infrared0)
))

)

; plan
1. (switch_on instrument7 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument7)
   goals met: 0 of 19
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 19
3. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 19
4. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 19
5. (turn_to satellite4 star4 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 star4)
   goals met: 1 of 19
6. (turn_to satellite4 star0 star4)
   deleted: (pointing satellite4 star4)
   added: (pointing satellite4 star0)
   goals met: 0 of 19
7. (calibrate satellite4 instrument7 star0)
   added: (calibrated instrument7)
   goals met: 0 of 19
8. (turn_to satellite4 phenomenon8 star0)
   deleted: (pointing satellite4 star0)
   added: (pointing satellite4 phenomenon8)
   goals met: 0 of 19
9. (take_image satellite4 phenomenon8 instrument7 thermograph4)
   added: (have_image phenomenon8 thermograph4)
   goals met: 1 of 19
10. (turn_to satellite4 planet14 phenomenon8)
   deleted: (pointing satellite4 phenomenon8)
   added: (pointing satellite4 planet14)
   goals met: 1 of 19
11. (take_image satellite4 planet14 instrument7 thermograph4)
   added: (have_image planet14 thermograph4)
   goals met: 2 of 19
12. (turn_to satellite4 planet19 planet14)
   deleted: (pointing satellite4 planet14)
   added: (pointing satellite4 planet19)
   goals met: 2 of 19
13. (take_image satellite4 planet19 instrument7 thermograph4)
   added: (have_image planet19 thermograph4)
   goals met: 3 of 19
14. (turn_to satellite4 star4 planet19)
   deleted: (pointing satellite4 planet19)
   added: (pointing satellite4 star4)
   goals met: 4 of 19
15. (turn_to satellite2 groundstation1 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 groundstation1)
   goals met: 4 of 19
16. (calibrate satellite2 instrument5 groundstation1)
   added: (calibrated instrument5)
   goals met: 4 of 19
17. (turn_to satellite2 phenomenon15 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 phenomenon15)
   goals met: 4 of 19
18. (take_image satellite2 phenomenon15 instrument5 spectrograph3)
   added: (have_image phenomenon15 spectrograph3)
   goals met: 5 of 19
19. (turn_to satellite2 phenomenon3 phenomenon15)
   deleted: (pointing satellite2 phenomenon15)
   added: (pointing satellite2 phenomenon3)
   goals met: 6 of 19
20. (turn_to satellite1 groundstation1 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 groundstation1)
   goals met: 6 of 19
21. (calibrate satellite1 instrument3 groundstation1)
   added: (calibrated instrument3)
   goals met: 6 of 19
22. (turn_to satellite1 phenomenon3 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon3)
   goals met: 6 of 19
23. (take_image satellite1 phenomenon3 instrument3 infrared0)
   added: (have_image phenomenon3 infrared0)
   goals met: 7 of 19
24. (turn_to satellite1 star11 phenomenon3)
   deleted: (pointing satellite1 phenomenon3)
   added: (pointing satellite1 star11)
   goals met: 7 of 19
25. (take_image satellite1 star11 instrument3 infrared0)
   added: (have_image star11 infrared0)
   goals met: 8 of 19
26. (turn_to satellite1 star16 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star16)
   goals met: 8 of 19
27. (take_image satellite1 star16 instrument3 thermograph2)
   added: (have_image star16 thermograph2)
   goals met: 9 of 19
28. (turn_to satellite1 star18 star16)
   deleted: (pointing satellite1 star16)
   added: (pointing satellite1 star18)
   goals met: 9 of 19
29. (take_image satellite1 star18 instrument3 thermograph2)
   added: (have_image star18 thermograph2)
   goals met: 10 of 19
30. (turn_to satellite1 star20 star18)
   deleted: (pointing satellite1 star18)
   added: (pointing satellite1 star20)
   goals met: 10 of 19
31. (take_image satellite1 star20 instrument3 infrared0)
   added: (have_image star20 infrared0)
   goals met: 11 of 19
32. (turn_to satellite1 star6 star20)
   deleted: (pointing satellite1 star20)
   added: (pointing satellite1 star6)
   goals met: 11 of 19
33. (take_image satellite1 star6 instrument3 thermograph2)
   added: (have_image star6 thermograph2)
   goals met: 12 of 19
34. (turn_to satellite1 star9 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star9)
   goals met: 13 of 19
35. (take_image satellite1 star9 instrument3 thermograph2)
   added: (have_image star9 thermograph2)
   goals met: 14 of 19
36. (turn_to satellite2 planet10 phenomenon3)
   deleted: (pointing satellite2 phenomenon3)
   added: (pointing satellite2 planet10)
   goals met: 13 of 19
37. (take_image satellite2 planet10 instrument5 image1)
   added: (have_image planet10 image1)
   goals met: 14 of 19
38. (turn_to satellite2 phenomenon3 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 phenomenon3)
   goals met: 15 of 19
39. (turn_to satellite2 planet13 phenomenon3)
   deleted: (pointing satellite2 phenomenon3)
   added: (pointing satellite2 planet13)
   goals met: 14 of 19
40. (take_image satellite2 planet13 instrument5 spectrograph3)
   added: (have_image planet13 spectrograph3)
   goals met: 15 of 19
41. (turn_to satellite2 phenomenon3 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 phenomenon3)
   goals met: 16 of 19
42. (turn_to satellite2 planet17 phenomenon3)
   deleted: (pointing satellite2 phenomenon3)
   added: (pointing satellite2 planet17)
   goals met: 15 of 19
43. (take_image satellite2 planet17 instrument5 image1)
   added: (have_image planet17 image1)
   goals met: 16 of 19
44. (turn_to satellite2 phenomenon3 planet17)
   deleted: (pointing satellite2 planet17)
   added: (pointing satellite2 phenomenon3)
   goals met: 17 of 19
45. (turn_to satellite2 planet5 phenomenon3)
   deleted: (pointing satellite2 phenomenon3)
   added: (pointing satellite2 planet5)
   goals met: 16 of 19
46. (take_image satellite2 planet5 instrument5 spectrograph3)
   added: (have_image planet5 spectrograph3)
   goals met: 17 of 19
47. (turn_to satellite2 phenomenon3 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 phenomenon3)
   goals met: 18 of 19
48. (turn_to satellite2 star4 phenomenon3)
   deleted: (pointing satellite2 phenomenon3)
   added: (pointing satellite2 star4)
   goals met: 17 of 19
49. (take_image satellite2 star4 instrument5 spectrograph3)
   added: (have_image star4 spectrograph3)
   goals met: 18 of 19
50. (turn_to satellite2 phenomenon3 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 phenomenon3)
   goals met: 19 of 19
